using System.Collections;
using System.Collections.Generic;
using UnityEngine;

public class Data : MonoBehaviour
{
    DataProperty dataProperty;


    private void Start()
    {
        
    }

    //получаем доступ к переменым
}





//свойства для создания банковскй карточки (ввод имени,с проверкой на пустую строчку и цифры)
//ввод возраста регистрастарции с прверкой на 18 лет (- и 0 убираем)

//задать год который сегодгня и свойство год оканчания дейсвтия карты(год выдачи +5лет)
//получием свойство год оканчания дейсвтия карты(год выдачи +5лет)

//задавать все свойства из внешнего срипта
//нельзя получит свойства/значения там гед задаем

//и вывести всю инфу о карте,в скрипте со свойствами